# Table of Content
01. Import Libraries
02. Import Data
03. Change Column Data Type (if necessary)
04. Finding Mixed-Type Data
05. Data Accuracy
06. Data Consistency
07. Data Duplicates
08. Missing Values
09. Export Data

# 01. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Adjust the setting to view all rows
pd.options.display.max_rows = None

In [3]:
# Adjust the setting to view all columns
pd.options.display.max_columns = None

# 02. Import Data

In [4]:
# Define the main project folder path
path = r'C:\Users\saich\Desktop\CareerFoundry\Data Immersion\Achievement 6 Advanced Analytics & Dashboard Design\11-2023 HDB Flat Resale Analysis'

In [5]:
# Import 'flat_resale_all.csv' from 'Prepared Data' folder
flat_resale = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_all.csv'), index_col = 0)

In [6]:
flat_resale.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,row_id
0,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,9000.0,86,0
1,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,Improved,1977,6000.0,86,1
2,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,Improved,1977,8000.0,86,2
3,1990-01-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,Improved,1977,6000.0,86,3
4,1990-01-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,New Generation,1976,47200.0,85,4

In [7]:
flat_resale.tail()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease,row_id
915366,2023-12-01,YISHUN,EXECUTIVE,826,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,780000.0,64,915366
915367,2023-12-01,YISHUN,EXECUTIVE,834,YISHUN ST 81,01 TO 03,142.0,Apartment,1988,785000.0,64,915367
915368,2023-01-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,07 TO 09,179.0,Multi Generation,1987,1080000.0,63,915368
915369,2023-12-01,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,01 TO 03,179.0,Multi Generation,1987,975000.0,63,915369
915370,2023-06-01,YISHUN,MULTI-GENERATION,633,YISHUN ST 61,04 TO 06,159.0,Multi Generation,1987,935000.0,63,915370

In [8]:
flat_resale.shape

(915371, 12)

In [9]:
flat_resale.info()

<class 'pandas.core.frame.DataFrame'>
Index: 915371 entries, 0 to 915370
Data columns (total 12 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                915371 non-null  object
 1   town                 915371 non-null  object
 2   flat_type            915371 non-null  object
 3   block                915371 non-null  object
 4   street_name          915371 non-null  object
 5   storey_range         915371 non-null  object
 6   floor_area_sqm       915371 non-null  float64
 7   flat_model           915371 non-null  object
 8   lease_commence_date  915371 non-null  int64
 9   resale_price         915371 non-null  float64
 10  remaining_lease      915371 non-null  int64
 11  row_id               915371 non-null  int64
dtypes: float64(2), int64(3), object(7)
memory usage: 90.8+ MB

# 03. Change Column Data Type (if necessary)

'month' column stores date information. It should be changed into datetime data type.

In [10]:
# Change 'month' column into datetime
flat_resale['month'] = pd.to_datetime(flat_resale['month'])

In [11]:
# Verify the changes
flat_resale.info()

<class 'pandas.core.frame.DataFrame'>
Index: 915371 entries, 0 to 915370
Data columns (total 12 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                915371 non-null  datetime64[ns]
 1   town                 915371 non-null  object
 2   flat_type            915371 non-null  object
 3   block                915371 non-null  object
 4   street_name          915371 non-null  object
 5   storey_range         915371 non-null  object
 6   floor_area_sqm       915371 non-null  float64
 7   flat_model           915371 non-null  object
 8   lease_commence_date  915371 non-null  int64
 9   resale_price         915371 non-null  float64
 10  remaining_lease      915371 non-null  int64
 11  row_id               915371 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(3), object(6)
memory usage: 90.8+ MB

# 04. Finding Mixed-type Data

In [12]:
# Check for any mixed-type columns - no output means no mixed-type data
for col in flat_resale.columns.tolist():
    weird = (flat_resale[[col]].applymap(type) != flat_resale[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (flat_resale[weird]) > 0:
        print (col)

No unusual findings.

# 05. Data Accuracy

In [13]:
# Check the descriptive statistics of numerical data
flat_resale.describe()

,month,floor_area_sqm,lease_commence_date,resale_price,remaining_lease,row_id
count,915371,915371.000000,915371.000000,9.153710e+05,915371.000000,915371.000000
mean,2006-05-28 03:21:12.314285696,95.695577,1988.147430,3.172368e+05,81.188855,457685.000000
min,1990-01-01 00:00:00,28.000000,1966.000000,5.000000e+03,42.000000,0.000000
25%,1998-12-01 00:00:00,73.000000,1981.000000,1.920000e+05,74.000000,228842.500000
50%,2005-02-01 00:00:00,93.000000,1986.000000,2.950000e+05,83.000000,457685.000000
75%,2013-07-01 00:00:00,113.000000,1996.000000,4.130000e+05,90.000000,686527.500000
max,2023-12-01 00:00:00,307.000000,2022.000000,1.500000e+06,101.000000,915370.000000
std,NaN,25.847794,10.530398,1.674032e+05,10.621328,264244.990965

No unusual findings.

# 06. Data Consistency

Check the data consistency for each categorical variable

### 06.1 town

In [14]:
# Check the unique values of 'town' column
flat_resale['town'].value_counts(dropna = False).sort_index()

town
ANG MO KIO         51658
BEDOK              66082
BISHAN             21118
BUKIT BATOK        43676
BUKIT MERAH        33915
BUKIT PANJANG      27339
BUKIT TIMAH         2489
CENTRAL AREA        7073
CHOA CHU KANG      37768
CLEMENTI           27803
GEYLANG            27938
HOUGANG            50072
JURONG EAST        24537
JURONG WEST        65825
KALLANG/WHAMPOA    26832
LIM CHU KANG          64
MARINE PARADE       7986
PASIR RIS          32924
PUNGGOL            19810
QUEENSTOWN         28487
SEMBAWANG          13431
SENGKANG           31629
SERANGOON          22636
TAMPINES           79133
TOA PAYOH          31217
WOODLANDS          64674
YISHUN             69255
Name: count, dtype: int64

No unusual findings.

###  06.2 flat_type

In [15]:
# Check the unique values of 'flat_type' column
flat_resale['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                1300
2 ROOM               11490
3 ROOM              293090
4 ROOM              347298
5 ROOM              192726
EXECUTIVE            68928
MULTI GENERATION       279
MULTI-GENERATION       260
Name: count, dtype: int64

'MULTI GENERATION' and 'MULTI-GENERATION' refer to the same flat type.

In [16]:
# Change the value 'MULTI GENERATION' into 'MULTI-GENERATION'
flat_resale['flat_type'] = flat_resale['flat_type'].replace('MULTI GENERATION', 'MULTI-GENERATION')

In [17]:
# Verify the changes
flat_resale['flat_type'].value_counts(dropna = False).sort_index()

flat_type
1 ROOM                1300
2 ROOM               11490
3 ROOM              293090
4 ROOM              347298
5 ROOM              192726
EXECUTIVE            68928
MULTI-GENERATION       539
Name: count, dtype: int64

### 06.3 storey_range

In [18]:
# Check the unique values of 'storey_range' column
flat_resale['storey_range'].value_counts(dropna = False).sort_index()

storey_range
01 TO 03    185921
04 TO 06    231460
07 TO 09    209142
10 TO 12    177723
13 TO 15     61644
16 TO 18     23824
19 TO 21     11311
22 TO 24      7347
25 TO 27      3371
28 TO 30      1615
31 TO 33       593
34 TO 36       555
37 TO 39       499
40 TO 42       237
43 TO 45        64
46 TO 48        48
49 TO 51        17
Name: count, dtype: int64

No unusual findings.

### 06.4 flat_model

In [19]:
flat_resale['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-Room                        21
2-room                        87
3Gen                          26
Adjoined flat               1234
Apartment                  35119
DBSS                        3186
Improved                  239037
Improved-Maisonette          125
Maisonette                 29362
Model A                   260407
Model A-Maisonette          2056
Model A2                   10008
Multi Generation             539
New Generation            187619
Premium Apartment          45603
Premium Apartment Loft       104
Premium Maisonette            86
Simplified                 57140
Standard                   42282
Terrace                      688
Type S1                      430
Type S2                      212
Name: count, dtype: int64

'2-Room' and '2-room' refer to the same flat model.

In [20]:
# Change the value '2-Room' into '2-room'
flat_resale['flat_model'] = flat_resale['flat_model'].replace('2-Room', '2-room')

In [21]:
# Verify the changes
flat_resale['flat_model'].value_counts(dropna = False).sort_index()

flat_model
2-room                       108
3Gen                          26
Adjoined flat               1234
Apartment                  35119
DBSS                        3186
Improved                  239037
Improved-Maisonette          125
Maisonette                 29362
Model A                   260407
Model A-Maisonette          2056
Model A2                   10008
Multi Generation             539
New Generation            187619
Premium Apartment          45603
Premium Apartment Loft       104
Premium Maisonette            86
Simplified                 57140
Standard                   42282
Terrace                      688
Type S1                      430
Type S2                      212
Name: count, dtype: int64

# 07. Data Duplicates

In [22]:
# Check if there are any full duplicates in the dataframe
flat_resale.duplicated().sum()

0

In [23]:
flat_resale.loc[flat_resale.duplicated()]

Empty DataFrame
Columns: [month, town, flat_type, block, street_name, storey_range, floor_area_sqm, flat_model, lease_commence_date, resale_price, remaining_lease, row_id]
Index: []

No unusual findings.

# 08. Missing Values

In [24]:
# Check the number of missing values in each column
flat_resale.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
resale_price           0
remaining_lease        0
row_id                 0
dtype: int64

No unusual findings.

# 09. Export Data

In [25]:
flat_resale.shape

(915371, 12)

In [26]:
# Export data to 'Prepared Data' folder in csv format
flat_resale.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'flat_resale_all (checked).csv'))